
actions =
    [ Action "面談" 0 "✆ 一名學生。"
        "彼此瞭解，是第一步。"
    , Action "面談" 0 "✆ 一名學生。"
        "每個人的生命，都是說不完的故事。"
    , Action "回應需求" 0 "本回合所出的教學卡，不需擲親和骰。"
        "說不出口的才算數。"
    , Action "弱勢生名額" 0 "放入一張新的學生卡，面向下。"
        "給學習一個機會。"
    , Action "試教" 0 "取回一張由自已所出，最頂端的教學卡。"
        "要瞭解現場教學，只有去現場教學。"
    , Action "試讀" 1 "將所有學生卡翻成正面。"
        "要熟悉教學現場，只有到教學現場。"
    , Action "記取經驗" 1 "取回一張棄牌堆中的教育卡。"
        "若沒有記錄，過去的就過去了。"
    , Action "記取經驗" 1 "取回一張棄牌堆中的教育卡。"
        "創造始於摹仿。"
    , Action "轉學" 2 "立即結算一張學生卡，\n再放入一名新的學生，面向下。"
        "至少我們曾經相聚過。"
    , Action "典範效應" 2 "將一張場上的技藝卡改為環境卡。"
        "臨而後可觀。"
   ]

students =
    [ Student "沈括" [A,K,R,V] 1 9 [a,c,m,n,p,s] []
        "博學善文，於天文、方志、律曆、音樂、\n醫藥、卜算無所不通，皆有所論著。"
    , Student "梵谷" [V] 2 8 [a,s] [c,e,n,p,s]
        "愈加思索，我愈覺得沒有什麼藝術，\n比對人群的愛更純粹。"
    , Student "莫札特" [A] 2 8 [a,e] [c,m,n,s]
        "旁人的讚美和謾罵我全不放在心上。\n我只跟著自己的感覺走。"
    , Student "徐光啟" [R] 2 8 [e,m] [a,e,p]
        "《幾何原本》者，度數之宗，\n所以窮方圓平直之情，\n盡規矩準繩之用也。"
    , Student "鐵木真" [K] 2 8 [p,s] [c,e,m,p]
        "我能征服世界，但不能征服死亡。"
    , Student "巴哈" [A,R] 1 5 [a,m] [e,m,p]
        "我非勤勉不可，誰能像我一樣的勤勉，\n就能有同樣的成就。"
    , Student "李清照" [A,R] 3 6 [a,c] [a,m,n,p]
        "此情無計可消除，才下眉頭，卻上心頭。"
    , Student "法布爾" [K,V] 1 5 [n,s] [a,m,n,s]
        "要遠離主流的道路，才能有新的發現。"
    , Student "阿基米德" [K,V] 3 6 [m,n] [a,e,n,s]
        "不要碰我的圖！"
    , Student "李白" [R,V] 1 5 [a,c] [a,n,p,s]
        "鐘鼓饌玉何足貴，但願長醉不願醒。"
    , Student "達爾文" [R,V] 3 6 [e,n] [e,m,p]
        "和友情相比，名聲、榮譽、快樂和財富，\n都是塵土。"
    , Student "張衡" [A,K] 1 5 [m,n] [a,m,p,s]
        "願竭力以守義兮，雖貧窮而不改。"
    , Student "鄧肯" [A,K] 3 6 [a,p] [a,m,s]
        "自由的身體蘊藏最高的智慧。"
    , Student "艾雪" [A,V] 1 5 [a,m] [e,m,n,s]
        "我的工作是遊戲：非常認真的遊戲。"
    , Student "屈原" [A,V] 3 6 [c,s] [m,n,p,s]
        "國無人莫我知兮，又何懷乎故都？\n既莫足爲美政兮，吾將從彭咸之所居。"
    , Student "紀政" [K,R] 1 5 [p,s] [c,e,m,s]
        "如果失去了勇氣，一切也都完了。"
    , Student "居禮夫人" [K,R] 3 6 [n] [p,s]
        "生命中的一切不足以恐懼，只足以瞭解。"
    , Student "愛迪生" [K,R,V] 3 7 [a,n,s] [a,p,s]
        "我的發明都不是湊巧。\n我一次又一次實驗，直到它化為現實。"
    , Student "薩提爾" [A,K,R] 3 7 [e,n,s] [a,c,n]
        "我要成為幫小孩觀察大人的偵探。"
    , Student "愛因斯坦" [A,R,V] 3 7 [m,n,s] [m,p,s]
        "我並不是很聰明，\n只是和問題相處得久一點。"
    , Student "法拉第" [A,K,V] 3 7 [a,n,p] [m,n,s]
        "插上了想像的翅膀，科學就能得勝。"
    , Student "克里希那穆提" [] 1 4 [s] []
        "年幼，無心向學，體弱而好幻。\n其師鄙之，常施毒打。父亦如是。\n然克氏處之泰然，寵辱不驚。"
    , Student "海倫凱勒" [K,R,Anti A,Anti V] 3 10 [e,s] [e,s]
        "離開了井後，我渴望學習：\n因為每樣東西都有一個名字。"
    , Student "周大觀" [A,R,V,Anti K] 3 10 [a,c,s] [p]
        "我還有一隻腳。"
    , Student "湯姆克魯斯" [A,K,V,Anti R] 3 10 [a,p,s] [e,m,s]
        "我常將字寫顛倒，閱讀又如此困難。\n我覺得大家都把我當笨蛋，羞恥極了。"
    , Student "胡一舟" [A,K,Anti R,Anti V] 3 10 [a] [c,m,s]
        "上帝無情地關上心智之窗，\n卻又慷慨地大開音樂之門。"
   ]

lessons =
    [ Lesson "放牛吃草" [K] 1 100 [a,p] []
        "就自由活動吧。"
    , Lesson "放牛吃草" [A] 1 100 [c,e,s] []
        "先去辦點事。"
    , Lesson "放牛吃草" [R] 1 100 [m,n] []
        "安靜自習！"
    , Lesson "照本宣科" [R] 0 0 [m,n] []
        "課本編得不好怎麼辦？"
    , Lesson "照本宣科" [A] 0 0 [m,n] []
        "有點不負責任。"
    , Lesson "照本宣科" [R] 0 0 [a,p] []
        "知識和迷信的界限在哪裡？"
    , Lesson "照本宣科" [A] 0 0 [a,p] []
        "站在巨人的腳印上。"
    , Lesson "照本宣科" [R] 0 0 [c,e,s] []
        "教育常變成複製。"
    , Lesson "照本宣科" [A] 0 0 [c,e,s] []
        "編課本使人成長，抄課本很難成長。"
    , Lesson "發現教學" [R,V] 3 0 [m,n] []
        "人不能在真空中學習。"
    , Lesson "發現教學" [A,V] 3 0 [c,e,s] []
        "能給問題，比給答案更重要。"
    , Lesson "發現教學" [K,V] 3 0 [a,p] []
        "能給問題，比給答案更重要。"
    , Lesson "討論教學" [A,V] 3 0 [m,n] []
        "良好的討論，不是爭辯，而是合作。"
    , Lesson "討論教學" [A,R] 3 0 [c,e,s] []
        "要交換意見，更要交換意見背後的視野。"
    , Lesson "討論教學" [A,K] 3 0 [a,p] []
        "能給問題，比給答案更重要。"
    , Lesson "實驗仿作" [K,V] 3 0 [a,n] []
        "實驗在理論之前。"
    , Lesson "實驗仿作" [K,R] 3 0 [m,n] []
        "思考實驗，也是一種實驗。"
    , Lesson "實驗仿作" [A,K] 3 0 [n,s] []
        "雖然早已預知結果，實驗還是令人驚奇。"
    , Lesson "趣味數學" [A,K,R] 0 0 [m] [i]
        "由趣味的數學，進入數學的趣味。"
    , Lesson "趣味科學" [A,K,R] 0 0 [n] [i]
        "偶而裝傻好像也不錯。"
    , Lesson "武術入門" [K,V] 1 1 [a,p] []
        "強身，健體，壯膽。"
    , Lesson "舞蹈入門" [A,K] 1 1 [a,p] []
        "從律動開始，讓身體自由。"
    , Lesson "歌唱入門" [A] 1 1 [a,c,e] []
        "欣賞自己的聲音。"
    , Lesson "精研武術" [K,V] 4 100 [a,p] []
        "不爭不鬥，止戈為武。"
    , Lesson "精研舞蹈" [A,K] 4 100 [a,p] []
        "台上一分鐘，台下十年功。"
    , Lesson "精研歌唱" [A] 4 100 [a,c,e] []
        "歌唱的技巧，聲音的表情。"
    , Lesson "指定閱讀" [R] 4 100 [c,e,s] []
        "問題是他肯不肯翻開第一頁？"
    , Lesson "指定閱讀" [R] 4 100 [a,m,n,p] []
        "有時教師比學生更了解他的需求。"
    , Lesson "自由閱讀" [R] 2 2 [c,n,p,s] []
        "像風一樣，你不停地跑。"
    , Lesson "自由閱讀" [R] 2 2 [a,e,m] []
        "被課本所限，就註定無知。"
    , Lesson "基本能力" [A,K,V] 0 4 [m,n] [u]
        "跳出死胡同，認識真學問。"
    , Lesson "基本能力" [A,K,R] 0 4 [c,e,s] [u]
        "不要在沙上蓋塔。"
    , Lesson "自學指導" [A,R,V] 4 0 [m,n] [l]
        "重點在如何檢查自己會不會。"
    , Lesson "自學指導" [A,K,R] 4 0 [c,e,s] [l]
        "知識是用拿的，不是用給的。"
    , Lesson "獨立研究" [] 7 100 [] [l]
        "最好的老師，讓學生離開他之後，\n也學得好。"
    , Lesson "個別輔導" [A] 1 3 [] [l]
        "許多人的教育之路，由家教和課輔開始。"
    , Lesson "個別輔導" [A] 1 3 [] [l]
        "最有效的診斷，是一對一。"
    , Lesson "小階梯教學" [A,V] 100 3 [] [u]
        "知識若切太細，雖然可以跟隨，\n卻會失去意義。"
    , Lesson "小階梯教學" [K,V] 100 3 [] [u]
        "有人需要一步一步慢慢來。"
    , Lesson "圖表分析" [R,V] 2 2 [n,s] []
        "圖表自己會說話。"
    , Lesson "資料分析" [R] 2 2 [m,s] []
        "表示法決定了資料的意義。"
    , Lesson "圖象秩序" [V] 2 2 [a,m] []
        "一目了然。"
    , Lesson "山訓" [K,V] 2 2 [n,p] [u]
        "我們爬的是不同的山。"
    , Lesson "情境教學" [A] 2 2 [a,e] [u]
        "身歷其境。"
    , Lesson "詩作賞析" [R] 2 2 [c,e] [u]
        "詩是文字的結晶。"
    , Lesson "戲劇社" [A,K] 2 2 [a,p,s] [u]
        "戴過許多面具，再來尋找自己。"
    , Lesson "籃球社" [K,V] 2 2 [p,s] [u]
        "打球打球！"
    , Lesson "寫作工坊" [A,R] 2 2 [a,c] [u]
        "創作是為了交流。"
    , Lesson "科學史" [R] 3 3 [m,n,s] []
        "掌握原始問題，就掌握了知識的大半。"
    , Lesson "語文史" [R] 3 3 [c,e,s] []
        "博古而能通今。"
    , Lesson "藝術史" [R] 3 3 [a,s] []
        "簡潔與合一，是美的泉源。"
    , Lesson "華德福教學" [V] 3 3 [a,n,p] []
        "透過身體，將意志帶進思考。"
    , Lesson "蒙特梭利教學" [K] 3 3 [a,m,n] []
        "不必主動去教，只需觀察、引導、解惑。"
    , Lesson "蘇格拉底教學" [A] 3 3 [e,m,s] []
        "我知我無知，所以就去問。"
    , Lesson "進階發現教學" [A,K,R,V] 4 2 [m,n,s] [u]
        "知識無法傳授，只能重新發生。"
    , Lesson "進階討論教學" [A,K,R,V] 4 2 [c,m,s] [u]
        "萬法歸宗。"
    , Lesson "經典研讀" [R] 4 4 [c] []
        "看解說，不如讀原典。"
    , Lesson "會話教學" [A] 4 4 [e] []
        "Here we speak \nEnglish only."
    , Lesson "體能集訓" [K] 4 4 [p] []
        "苦練、苦練、再苦練。"
    , Lesson "啟蒙導師遊戲" [A,K,R,V] 4 4 [s] [i]
        "請支持自創遊戲！"
   ]

skills =
    [ Skill "以火點火" "教學額外具有 ♥ 能力。"
        "授己所愛，愛己所授。"
    , Skill "以心傳心" "即使學習風格不合，教學仍視為成功。"
        "佛陀拈花，迦葉微笑。"
    , Skill "同理" "教學額外具有 ✙ 能力。"
        "向童年的自己學習。"
    , Skill "巧思" "教學卡皆獲得 +1 力道。"
        "尺有所短，寸有所長。"
    , Skill "圖象" "教學可額外具有或失去視覺風格。"
        "圖象比文字更鮮明。"
    , Skill "音符" "教學可額外具有或失去聽覺風格。"
        "共鳴，直接的共鳴。"
    , Skill "文字" "教學可額外具有或失去閱讀風格。"
        "凡能寫的，都能寫清楚。"
    , Skill "實作" "教學可額外具有或失去操作風格。"
        "學以致用，從做中學。"
    , Skill "搞笑" "無興趣時，蒙昧值取左。"
        "他們喜歡的，是學問本身？"
    , Skill "敏銳" "只需 1 ⏎ 即可觀察學生。"
        "讓小孩教你怎樣教他。"
    , Skill "敏銳" "只需 1 ⏎ 即可觀察學生。"
        "先放下著急與成見。"
    , Skill "親和" "親和骰擲出 2 亦可成功。"
        "大表總比老師好。"
    , Skill "親和" "親和骰擲出 2 亦可成功。"
        "放下身段，以身作則。"
    , Skill "專業" "額外壓印一張教學卡：\n對此卡上每一學門，教學力道 +3。"
        "教學技巧好練，學門專業難修。"
    , Skill "專業" "額外壓印一張教學卡：\n對此卡上每一學門，教學力道 +3。"
        "聞道有先後，術業有專攻。"
   ]

environments =
    [ Environment "獨立教育工作者社群" "所有技藝卡改為環境卡，且只需 0 ⏎\n。"
        "交流採借，就會成長。"
    , Environment "師生人格平等" "所有人的親和骰點數 +1。"
        "沒有絕對的施與受。"
   ]

assistants =
    [ Assistant "萬事通" [R,Anti A] [a,p] [u] 2
        "讀萬卷書，行萬里路。"
    , Assistant "大聲公" [A,Anti R] [s] [u] 2
        "沒關係，再說一遍。"
    , Assistant "小畫家" [V,Anti K] [c,e] [u] 2
        "這樣看，明白了嗎？"
    , Assistant "金手指" [K,Anti V] [m,n] [u] 2
        "常有欲，以觀其徼。"
    , Assistant "妙博士" [] [] [i] 4
        "常無欲，以觀其妙。"
   ]
