
students =
    [ Student "沈括" [A,K,R,V] 1 9 [a,c,m,n,p,s] []
        "博學善文，於天文、方志、律曆、音樂、\n醫藥、卜算無所不通，皆有所論著。"
    , Student "梵谷" [V] 2 8 [a,s] [c,e,n,p,s]
        "愈加思索，我愈覺得沒有什麼藝術，\n比對人群的愛更純粹。"
    , Student "莫札特" [A] 2 8 [a,p] [c,m,n,s]
        "旁人的讚美和謾罵我全不放在心上。\n我只跟著自己的感覺走。"
    , Student "徐光啟" [R] 2 8 [e,m] [a,e,p]
        "余以為小用、大用，實在其人。"
    , Student "鐵木真" [K] 2 8 [p,s] [c,e,m,p]
        "我能征服世界，但不能征服死亡。"
    , Student "巴哈" [A,R] 1 5 [a,m] [e,m,p]
        "我非勤勉不可，誰能像我一樣的勤勉，\n就能有同樣的成就。"
    , Student "李清照" [A,R] 3 6 [a,c] [a,m,n,p]
        "此情無計可消除，才下眉頭，卻上心頭。"
    , Student "法布爾" [K,V] 1 5 [n,s] [a,m,n,s]
        "你們把昆蟲肢解，\n而我是研究活生生的昆蟲。"
    , Student "阿基米德" [K,V] 3 6 [m,n] [a,e,n,s]
        "不要動我的圖！"
    , Student "李白" [R,V] 1 5 [a,c] [a,n,p,s]
        "君不見，黃河之水天上來，\n奔流到海不復回。"
    , Student "達爾文" [R,V] 3 6 [e,n] [e,m,p]
        "名聲、榮譽、快樂、財富，\n如果同友情相比，它們都是塵土。"
    , Student "張衡" [A,K] 1 5 [m,n] [a,m,p,s]
        "願竭力以守義兮，雖貧窮而不改。"
    , Student "鄧肯" [A,K] 3 6 [a,p] [a,m,s]
        "最自由的身體蘊藏最高的智慧。"
    , Student "艾雪" [A,V] 1 5 [a,m] [e,m,n,s]
        "我立體幾何稍好，因為和想像能共鳴。\n即使如此，在學校也沒唸得很好。"
    , Student "屈原" [A,V] 3 6 [c,s] [m,n,p,s]
        "國無人莫我知兮，又何懷乎故都？\n既莫足爲美政兮，吾將從彭咸之所居。"
    , Student "愛迪生" [K,R,V] 3 7 [a,n,s] [a,p,s]
        "我的發明都不是碰巧的。\n我一次又一次地實驗，直到它化為現實。"
    , Student "薩提爾" [A,K,R] 3 7 [e,n,s] [a,c,n]
        "我要成為幫小孩觀察大人的偵探。"
    , Student "愛因斯坦" [A,R,V] 3 7 [m,n,s] [m,p,s]
        "我並不是很聰明，\n只是和問題相處得久一點。"
    , Student "法拉第" [A,K,V] 3 7 [a,n,p] [m,n,s]
        "一旦科學插上幻想的翅膀，\n它就能贏得勝利。"
    , Student "克里希那穆提" [] 1 2 [s] []
        "年幼，無心向學，體弱而好幻。\n其師鄙之，常施毒打。父亦如是。\n然克氏處之泰然，寵辱不驚。"
   ]

lessons =
   [
   ]
